INSERT INTO
  books (
    user_id,
    title,
    total_pages,
    author,
    publisher,
    isbn
  )
VALUES
  -- demo-1
  (
    'demo-1',
    '独習JavaScript',
    576,
    'CodeMafia 外村将大',
    '翔泳社',
    '9784798160276'
  ),
  (
    'demo-1',
    '改訂3版 JavaScript本格入門',
    624,
    '山田祥寛',
    '技術評論社',
    '9784297132880'
  ),
  (
    'demo-1',
    '現場で使えるTypeScript 詳解実践ガイド',
    336,
    '菅原浩之',
    'マイナビ出版',
    '9784839984274'
  ),
  (
    'demo-1',
    'プロを目指す人のためのTypeScript入門',
    424,
    '鈴木僚太',
    '技術評論社',
    '9784297127473'
  ),
  (
    'demo-1',
    'モダンJavaScriptの基本から始める React実践の教科書',
    272,
    'じゃけぇ（岡田拓巳）',
    'SBクリエイティブ',
    '9784815610722'
  ),
  (
    'demo-1',
    '改訂新版 これからはじめるReact実践入門',
    688,
    '山田祥寛',
    'SBクリエイティブ',
    '9784815635947'
  ),
  (
    'demo-1',
    'TypeScriptとReact/Next.jsでつくる 実践Webアプリケーション開発',
    448,
    '手島拓也，吉田健人，高林佳稀',
    '技術評論社',
    '9784297129163'
  ),

  -- demo-2
  (
    'demo-2',
    'スッキリわかるJava入門 第4版',
    760,
    '中山清喬，国本大悟',
    'インプレス',
    '9784295017936'
  ),
  (
    'demo-2',
    'スッキリわかるJava入門 実践編 第4版',
    744,
    '中山清喬',
    'インプレス',
    '9784295018452'
  ),
  (
    'demo-2',
    'リーダブルコード',
    260,
    'ダスティンボズウェル, トレバーフォシェ',
    'オライリージャパン',
    '9784873115658'
  ),
  (
    'demo-2',
    'プロになるJava',
    512,
    'きしだなおき，山本裕介，杉山貴章',
    '技術評論社',
    '9784297126858'
  ),

  -- demo-3
  (
    'demo-3',
    'Webを支える技術 HTTP,URI,HTML,そしてREST',
    400,
    '山本陽平',
    '技術評論社',
    '9784774142043'
  ),
  (
    'demo-3',
    '達人プログラマー（第2版）',
    448,
    'David Thomas, Andrew Hunt',
    'オーム社',
    '9784274226298'
  ),
  (
    'demo-3',
    'ネットワークはなぜつながるのか 第2版',
    448,
    '戸根勤',
    '日経BP',
    '9784822283117'
  ),
  (
    'demo-3',
    '達人に学ぶDB設計徹底指南書 第2版',
    392,
    'ミック',
    '翔泳社',
    '9784798186627'
  ),
  (
    'demo-3',
    '達人に学ぶSQL徹底指南書 第2版',
    368,
    'ミック',
    '翔泳社',
    '9784798157825'
  ),
  (
    'demo-3',
    '新しいLinuxの教科書 第2版',
    448,
    '三宅英明，大角祐介',
    'SBクリエイティブ',
    '9784815624316'
  ),

  -- demo-readonly
  (
    'demo-readonly',
    'SQL 第2版 ゼロからはじめるデータベース操作',
    336,
    'ミック',
    '翔泳社',
    '9784798144450'
  ),
  (
    'demo-readonly',
    'プログラムはなぜ動くのか 第3版',
    308,
    '矢沢久雄',
    '日経BP',
    '9784296000197'
  ),
  (
    'demo-readonly',
    'プリンシプル オブ プログラミング',
    304,
    '上田勲',
    '秀和システム',
    '9784798046143'
  );